const hollyQuran = [
  {
    sura: 1,
    name: "الفاتحة",
    ayat: [
      "بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ (1)",
      "ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ (2)",
      "ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ (3)",
      "مَٰلِكِ يَوۡمِ ٱلدِّينِ (4)",
      "إِيَّاكَ نَعۡبُدُ وَإِيَّاكَ نَسۡتَعِينُ (5)",
      "ٱهۡدِنَاٱلصِّرَٰطَ ٱلۡمُسۡتَقِيمَ (6)",
      "صِرَٰطَ ٱلَّذِينَ أَنۡعَمۡتَ عَلَيۡهِمۡ غَيۡرِ ٱلۡمَغۡضُوبِ عَلَيۡهِمۡ وَلَا ٱلضَّآلِّينَ (7)",
    ],
  },
  {
    sura: 2,
    name: "البقرة",
    ayat: [
      " الٓمٓ (1)",
      "ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ (2)",
      "ٱلَّذِينَ يُؤۡمِنُونَ بِٱلۡغَيۡبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ (3)",
      "وَٱلَّذِينَ يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ وَمَآ أُنزِلَ مِن قَبۡلِكَ وَبِٱلۡأٓخِرَةِ هُمۡ يُوقِنُونَ (4)",
      "أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ (5)",
      "إِنَّ ٱلَّذِينَ كَفَرُواْ سَوَآءٌ عَلَيۡهِمۡ ءَأَنذَرۡتَهُمۡ أَمۡ لَمۡ تُنذِرۡهُمۡ لَا يُؤۡمِنُونَ (6)",
      "خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمۡ وَعَلَىٰ سَمۡعِهِمۡۖ وَعَلَىٰٓ أَبۡصَٰرِهِمۡ غِشَٰوَةٞۖ وَلَهُمۡ عَذَابٌ عَظِيمٞ (7)",
      "وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلۡيَوۡمِ ٱلۡأٓخِرِ وَمَا هُم بِمُؤۡمِنِينَ (8)",
      "يُخَٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُواْ وَمَا يَخۡدَعُونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ (9)",
      "فِي قُلُوبِهِم مَّرَضٞ فَزَادَهُمُ ٱللَّهُ مَرَضٗاۖ وَلَهُمۡ عَذَابٌ أَلِيمُۢ بِمَا كَانُواْ يَكۡذِبُونَ (10)",
    ],
  },
  {
    sura: 78,
    name: "النبأ",
    ayat: [
      "عَمَّ يَتَسَآءَلُونَ (1)",
      "عَنِ ٱلنَّبَإِ ٱلۡعَظِيمِ (2)",
      "ٱلَّذِي هُمۡ فِيهِ مُخۡتَلِفُونَ (3)",
      "كَلَّا سَيَعۡلَمُونَ (4)",
      "ثُمَّ كَلَّا سَيَعۡلَمُونَ (5)",
      "أَلَمۡ نَجۡعَلِ ٱلۡأَرۡضَ مِهَٰدٗا (6)",
      "وَٱلۡجِبَالَ أَوۡتَادٗا (7)",
      "وَخَلَقۡنَٰكُمۡ أَزۡوَٰجٗا (8)",
      "وَجَعَلۡنَا نَوۡمَكُمۡ سُبَاتٗا (9)",
      "وَجَعَلۡنَا ٱلَّيۡلَ لِبَاسٗا (10)",
      "وَجَعَلۡنَا ٱلنَّهَارَ مَعَاشٗا (11)",
      "وَبَنَيۡنَا فَوۡقَكُمۡ سَبۡعٗا شِدَادٗا (12)",
      "وَجَعَلۡنَا سِرَاجٗا وَهَّاجٗا (13)",
      "وَأَنزَلۡنَا مِنَ ٱلۡمُعۡصِرَٰتِ مَآءٗ ثَجَّاجٗا (14)",
      "لِّنُخۡرِجَ بِهِۦ حَبّٗا وَنَبَاتٗا (15)",
      "وَجَنَّٰتٍ أَلۡفَافًا (16)",
      "إِنَّ يَوۡمَ ٱلۡفَصۡلِ كَانَ مِيقَٰتٗا (17)",
      "يَوۡمَ يُنفَخُ فِي ٱلصُّورِ فَتَأۡتُونَ أَفۡوَاجٗا (18)",
      "وَفُتِحَتِ ٱلسَّمَآءُ فَكَانَتۡ أَبۡوَٰبٗا (19)",
      "وَسُيِّرَتِ ٱلۡجِبَالُ فَكَانَتۡ سَرَابًا (20)",
      "إِنَّ جَهَنَّمَ كَانَتۡ مِرۡصَادٗا (21)",
      "لِّلطَّٰغِينَ مَـَٔابٗا (22)",
      "لَّٰبِثِينَ فِيهَآ أَحۡقَابٗا (23)",
      "لَّا يَذُوقُونَ فِيهَا بَرۡدٗا وَلَا شَرَابًا (24)",
      "إِلَّا حَمِيمٗا وَغَسَّاقٗا (25)",
      "جَزَآءٗ وِفَاقًا (26)",
      "إِنَّهُمۡ كَانُواْ لَا يَرۡجُونَ حِسَابٗا (27)",
      "وَكَذَّبُواْ بِـَٔايَٰتِنَا كِذَّابٗا (28)",
      "وَكُلَّ شَيۡءٍ أَحۡصَيۡنَٰهُ كِتَٰبٗا (29)",
      "فَذُوقُواْ فَلَن نَّزِيدَكُمۡ إِلَّا عَذَابًا (30)",
      "إِنَّ لِلۡمُتَّقِينَ مَفَازًا (31)",
      "حَدَآئِقَ وَأَعۡنَٰبٗا (32)",
      "وَكَوَاعِبَ أَتۡرَابٗا (33)",
      "وَكَأۡسٗا دِهَاقٗا (34)",
      "لَّا يَسۡمَعُونَ فِيهَا لَغۡوٗا وَلَا كِذَّٰبٗا (35)",
      "جَزَآءٗ مِّن رَّبِّكَ عَطَآءً حِسَابٗا (36)",
      "رَّبِّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَمَا بَيۡنَهُمَا ٱلرَّحۡمَٰنِۖ لَا يَمۡلِكُونَ مِنۡهُ خِطَابٗا (37)",
      "يَوۡمَ يَقُومُ ٱلرُّوحُ وَٱلۡمَلَٰٓئِكَةُ صَفّٗاۖ لَّا يَتَكَلَّمُونَ إِلَّا مَنۡ أَذِنَ لَهُ ٱلرَّحۡمَٰنُ وَقَالَ صَوَابٗا (38)",
      "ذَٰلِكَ ٱلۡيَوۡمُ ٱلۡحَقُّۖ فَمَن شَآءَ ٱتَّخَذَ إِلَىٰ رَبِّهِۦ مَـَٔابًا (39)",
      "إِنَّآ أَنذَرۡنَٰكُمۡ عَذَابٗا قَرِيبٗا يَوۡمَ يَنظُرُ ٱلۡمَرۡءُ مَا قَدَّمَتۡ يَدَاهُ وَيَقُولُ ٱلۡكَافِرُ يَٰلَيۡتَنِي كُنتُ تُرَٰبَۢا (40)",
    ],
  },
];

const aya = document.getElementById("aya");
const btn = document.getElementById("btn");
const sura = document.getElementById("sura");

btn.addEventListener("click", chooseRandom);

function chooseRandom() {
  const random = Math.floor(Math.random() * hollyQuran.length);
  const ayatRandom = Math.floor(Math.random() * hollyQuran[random].ayat.length);
  const currentAya = hollyQuran[random].ayat[ayatRandom];
  const currentSura = hollyQuran[random].name;
  aya.innerHTML = `" ${currentAya} "`;
  sura.innerHTML = `-- ${currentSura} --`;
}
